{
  
    "much-ado-about-gluten": {
      "title": "Much Ado About Gluten",
      "url": "/much-ado-about-gluten/",
      "summary": "Have you ever bought a loaf of gluten-free bread only to be disappointed by its dry, crumbly texture? On the other hand, have you ever tried gluten-free brownies that were indistinguishable from regular brownies? Why do some recipes translate so well to gluten-free while others don’t? The answer is in...",
      "content": "Have you ever bought a loaf of gluten-free bread only to be disappointed by its dry, crumbly texture? On the other hand, have you ever tried gluten-free brownies that were indistinguishable from regular brownies? Why do some recipes translate so well to gluten-free while others don’t? The answer is in the name-gluten.Gluten is a network of several different proteins that bind together with kneading. As you knead bread, the gluten networks that you form are what help trap CO2 as the dough rises. The gluten networks also give bread its chewy texture. The word gluten actually comes from the Latin word for glue.The problem, and the advantage, to gluten-free baking is the lack of gluten. Without the gluten networks, your bread is going to have a hard time trapping that CO2 and developing a chewy texture. Conversely, something like pie crust which should be flaky, not chewy, doesn’t need gluten. Gluten-free brownies often turn out so tasty because they also don’t need the chewy gluten network.To help mimic the gluten networks, gluten-free breads and flour mixes will often utilize xanthan gum to help give the final product a more chewy texture. Unfortunately, there are so many different flour mixes out there that each behave differently. This results in quite a bit of trial and error to end up with an end product you are happy with. We should say expensive trial and error because gluten-free flour mixes generally cost three to four times as much as regular flour.With that being said, we are here to do all the work so that you don’t have to. In coming posts, we’ll be comparing and contrasting different gluten-free flour mixes to find the best flour for the recipe. We’ll be sharing our favorite mixes, tips, and tricks to make sure no one associates your gluten-free baking with flavor-free baking.Do you have any tips or tricks for gluten-free baking? Is there a particular flour mix that gives you good results? Let us know and we’ll be sure to try them out!"
    }
    ,
  
    "st-pattys-bread": {
      "title": "St. Patty's Day Bread",
      "url": "/st-pattys-bread/",
      "summary": "It’s hard to find a good gluten-free bread mix at a low cost. The brand Gluten-Free Heaven does not disappoint. We came across them at the Salt Lake Gluten-Free Expo and have tried several of their products since. For our St. Patrick’s Day bread, we used their white bread mix...",
      "content": "It’s hard to find a good gluten-free bread mix at a low cost. The brand Gluten-Free Heaven does not disappoint. We came across them at the Salt Lake Gluten-Free Expo and have tried several of their products since. For our St. Patrick’s Day bread, we used their white bread mix (with some added food coloring ;) ).The bread turned out amazing! It was moist, soft, didn’t fall apart, and had a nice crust. It was by far the best packaged bread mix we’ve ever used.Do you want to know the best part? Not only do they ship, but the prices are fantastic! It only costs $4.49 for the mix, which is cheaper than most pre-made gluten-free bread. If you haven’t given them a look, we highly recommend them."
    }
    ,
  
    "buttermilk-biscuits": {
      "title": "Buttermilk Biscuits",
      "url": "/buttermilk-biscuits/",
      "summary": "Buttermilk biscuits are a staple of southern cooking. Unfortunately, when it comes to making gluten-free biscuits, it can be quite difficult to get it right. Not anymore! This recipe has been approved by southerners and some say they can’t even tell the difference between this and a normal biscuit.Ingredient List...",
      "content": "Buttermilk biscuits are a staple of southern cooking. Unfortunately, when it comes to making gluten-free biscuits, it can be quite difficult to get it right. Not anymore! This recipe has been approved by southerners and some say they can’t even tell the difference between this and a normal biscuit.Ingredient List  1 3/4 cups cup4cup gluten-free flour  1 cup cold buttermilk  1 stick frozen butter  2 tsp baking powder  1/2 tsp baking soda  1 tsp saltInstructions:  Preheat oven to 425° F  Place some ice in a large bowl and place a smaller mixing bowl inside  Grate the frozen butter into the mixing bowl  Mix together the dry ingredients  Add the dry ingredients to the grated butter and toss together with a fork  Add the cold buttermilk and mix until a clumpy dough forms  Place the dough on a lightly floured surface and press to about one inch thick  Cut out biscuits 2-3 inches in diameter  Place biscuits on a baking sheet lined with parchmet paper  Bake for about 15 minutes"
    }
    ,
  
    "introduction": {
      "title": "Introduction",
      "url": "/introduction/",
      "summary": "We are the Porter family. My wife Brittany has celiac disease and we have been living a gluten-free lifestyle for the past three years. When it comes to gluten-free food, taste doesn’t take center stage and it is often expensive. We’re on a journey to find and share recipes, flours,...",
      "content": "We are the Porter family. My wife Brittany has celiac disease and we have been living a gluten-free lifestyle for the past three years. When it comes to gluten-free food, taste doesn’t take center stage and it is often expensive. We’re on a journey to find and share recipes, flours, and mixes that don’t compromise on flavor or texture."
    }
    
  
}