{
  
    "buttermilk-biscuits": {
      "title": "Buttermilk Biscuits",
      "url": "/buttermilk-biscuits/",
      "summary": "Buttermilk biscuits are a staple of southern cooking. Unfortunately, when it comes to making gluten-free biscuits, it can be quite difficult to get it right. Not anymore! This recipe has been approved by southerners and some say they can’t even tell the difference between this and a normal biscuit.Ingredient List...",
      "content": "Buttermilk biscuits are a staple of southern cooking. Unfortunately, when it comes to making gluten-free biscuits, it can be quite difficult to get it right. Not anymore! This recipe has been approved by southerners and some say they can’t even tell the difference between this and a normal biscuit.Ingredient List  1 3/4 cups cup4cup gluten-free flour  1 cup cold buttermilk  1 stick frozen butter  2 tsp baking powder  1/2 tsp baking soda  1 tsp saltInstructions:  Preheat oven to 425° F  Place some ice in a large bowl and place a smaller mixing bowl inside  Grate the frozen butter into the mixing bowl  Mix together the dry ingredients  Add the dry ingredients to the grated butter and toss together with a fork  Add the cold buttermilk and mix until a clumpy dough forms  Place the dough on a lightly floured surface and press to about one inch thick  Cut out biscuits 2-3 inches in diameter  Place biscuits on a baking sheet lined with parchmet paper  Bake for about 15 minutes"
    }
    ,
  
    "introduction": {
      "title": "Introduction",
      "url": "/introduction/",
      "summary": "We are the Porter family. My wife Brittany has celiac disease and we have been living a gluten-free lifestyle for the past three years. When it comes to gluten-free food, taste doesn’t take center stage and it is often expensive. We’re on a journey to find and share recipes, flours,...",
      "content": "We are the Porter family. My wife Brittany has celiac disease and we have been living a gluten-free lifestyle for the past three years. When it comes to gluten-free food, taste doesn’t take center stage and it is often expensive. We’re on a journey to find and share recipes, flours, and mixes that don’t compromise on flavor or texture."
    }
    
  
}